{
  "irVersion": "1.0",
  "project": "ogen-tools",
  "repository": "https://github.com/plexusone/ogen-tools",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify", "johncwang@gmail.com"],
  "releases": [
    {
      "version": "v0.2.0",
      "date": "2026-02-28",
      "highlights": [
        { "description": "Organization rename from agentplexus to plexusone" }
      ],
      "changed": [
        { "description": "**Breaking**: Module path changed from `github.com/agentplexus/ogen-tools` to `github.com/plexusone/ogen-tools`", "commit": "74707ba" }
      ],
      "fixed": [
        { "description": "Use `#nosec` directive for gosec G703 suppressions in CLI tools", "commit": "b949aa1" }
      ],
      "dependencies": [
        { "description": "Bump `github.com/ogen-go/ogen` from 1.18.0 to 1.20.0", "commit": "584d706" }
      ],
      "build": [
        { "description": "Update Go versions in CI workflow", "commit": "8fe31a5" }
      ]
    },
    {
      "version": "v0.1.1",
      "date": "2026-01-19",
      "dependencies": [
        { "description": "Update Go module dependencies", "commit": "e319d6c" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2025-12-31",
      "highlights": [
        { "description": "Initial release of ogen-tools CLI utilities for ogen-go code generation fixes" }
      ],
      "added": [
        { "description": "`ogen-fixerror` CLI tool to fix UnexpectedStatusCode returns in generated response decoders", "commit": "49491e4" },
        { "description": "`ogen-fixnull` CLI tool to fix Opt* Decode methods to handle null JSON values correctly", "commit": "49491e4" }
      ],
      "build": [
        { "description": "golangci-lint configuration and fixes", "commit": "1c2ae8c" }
      ],
      "documentation": [
        { "description": "README with usage instructions", "commit": "1625200" }
      ]
    }
  ]
}
